; domain
(define (domain pinwheel-wreath)
  (:requirements :strips :typing)
  (:types
    paper wreath pinwheel twine)

  (:predicates
    ;;
    (selected ?p - paper)          ;
    (knowledge ?p - paper)         ;
    (has-shape ?p - paper)         ;

    ;;
    (made ?pw - pinwheel)          ;
    (attached ?pw - pinwheel)      ;

    ;;
    (base-chosen ?w - wreath)      ;

    ;;   /
    (twine-attached ?t - twine)    ;   /
    (twine-located ?t - twine)     ;   /
  )

  ;;    1:
  (:action select-paper
    :parameters (?p - paper)
    :precondition (and (not (selected ?p)) (not (knowledge ?p)))
    :effect (and (selected ?p) (knowledge ?p))
  )

  ;;    2:
  (:action make-pinwheel
    :parameters (?pw - pinwheel ?p - paper)
    :precondition (and (selected ?p) (has-shape ?p) (not (made ?pw)))
    :effect (made ?pw)
  )

  ;;    3:
  (:action choose-wreath-base
    :parameters (?w - wreath)
    :precondition (not (base-chosen ?w))
    :effect (base-chosen ?w)
  )

  ;;    4:     /
  (:action attach-twine
    :parameters (?t - twine ?w - wreath)
    :precondition (and (base-chosen ?w) (not (twine-attached ?t)) (not (twine-located ?t)))
    :effect (and (twine-attached ?t) (twine-located ?t))
  )

  ;;    5:
  (:action attach-pinwheel
    :parameters (?pw - pinwheel ?w - wreath)
    :precondition (and (made ?pw) (base-chosen ?w) (not (attached ?pw)))
    :effect (attached ?pw)
  )
)

; problem
(define (problem make-pinwheel-wreath)
  (:domain pinwheel-wreath)
  (:objects
    p1 - paper
    w1 - wreath
    pw1  - pinwheel
    t1 - twine
  )

  (:init
    ;;     ：
    (not (selected p1))
    (not (knowledge p1))
    (has-shape p1)
    (not (made pw1))
    (not (attached pw1))
    (not (base-chosen w1))
    (not (twine-attached t1))
    (not (twine-located t1))
  )

  (:goal
    (and
      ;;     ：
      (selected p1)
      (knowledge p1)
      (has-shape p1)

      ;;
      (made pw1)
      (attached pw1)

      ;;
      (base-chosen w1)

      ;;   /
      (twine-attached t1)
      (twine-located t1)
    )
  )
)

; plan
1. (select-paper p1)
   added: (selected p1) (knowledge p1)
   goals met: 3 of 8
2. (make-pinwheel pw1 p1)
   added: (made pw1)
   goals met: 4 of 8
3. (choose-wreath-base w1)
   added: (base-chosen w1)
   goals met: 5 of 8
4. (attach-pinwheel pw1 w1)
   added: (attached pw1)
   goals met: 6 of 8
5. (attach-twine t1 w1)
   added: (twine-attached t1) (twine-located t1)
   goals met: 8 of 8
